# Задача 8: Требуется определить, можно ли от шоколадки размером n × m 
# долек отломить k долек, если разрешается сделать один разлом по прямой 
# между дольками (то есть разломить шоколадку на два прямоугольника).

# *Пример:*
# 3 2 4 -> yes
# 3 2 1 -> no


n = int(input('Введите длинну шоколадки: '))
m = int(input('Введите ширину шоколадки: '))
k = int(input('Сколько отломить долек? '))


if k % n == 0 or k % m == 0:
    if n != m and k != m or k != n:
        print('Yes')
    else:
        print('No')
else:
    print('No')
