
# Сумма элементов списка

# ● Контекст
# Мы уже видели множество решений этой задачи в различных 
# стилях. Пришло время решить её с помощью логической 
# парадигмы.

# ● Ваша задача
# Написать программу на языке Prolog для вычисления суммы 
# элементов списка. На вход подаётся целочисленный массив. 
# На выходе - сумма элементов массива.

arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(sum(arr))
